[Killed] ObjectLiteral
main/components/Announcement/AnnouncementForm.js:55:43
                     id="start"
                     type="datetime-local"
                     isInvalid={Boolean(errors.start)}
-                    {...register("start", {
-                        required: "Start is required.",
-                        pattern: isodate_regex
-                    })}
+                    {...register("start", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Start is required and must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.js:61:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.start && 'Start is required and must be provided in ISO format.'}
+                    {errors.start || 'Start is required and must be provided in ISO format.'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:61:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.start && 'Start is required and must be provided in ISO format.'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Start is required and must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Survived] LogicalOperator
main/components/Announcement/AnnouncementForm.js:77:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.end && 'End must be provided in ISO format.'}
+                    {errors.end || 'End must be provided in ISO format.'}
                 </Form.Control.Feedback>
             </Form.Group>

[Survived] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:77:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.end && 'End must be provided in ISO format.'}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
