[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:36:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: 'Start Date ISO Format',
+            Header: "",
             accessor: 'start',
         },
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Start Date ISO Format. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; disp

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:37:23
         },
         {
             Header: 'Start Date ISO Format',
-            accessor: 'start',
+            accessor: "",
         },
         {
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-start"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementTable.js:39:9
             Header: 'Start Date ISO Format',
             accessor: 'start',
         },
-        {
-            Header: 'End Date ISO Format',
-            accessor: 'end',
-        },
+        {},
         {
             Header: 'Announcement',
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:45:23
         },
         {
             Header: 'Announcement',
-            accessor: 'announcement',
+            accessor: "",
         }
     ];
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-announcement"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.js:49:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:50:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "AnnouncementTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"));
     } 
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
