[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:87:9
             id: 'commons.showLeaderboard', // needed for tests
             accessor: (row, _rowIndex) => String(row.commons.showLeaderboard) // hack needed for boolean values to show up
         },
-        {
-            Header:<span> Show <br /> Chat? </span>,
-            id: 'commons.showChat',
-            accessor: (row, _rowIndex) => String(row.commons.showChat)
-        },
+        {},
         {
             Header: <span> Tot <br /> Cows </span>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:90:23
         {
             Header:<span> Show <br /> Chat? </span>,
             id: 'commons.showChat',
-            accessor: (row, _rowIndex) => String(row.commons.showChat)
+            accessor: () => undefined
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
