[Killed] ConditionalExpression
main/components/Utils/HomePageBackground.js:8:9
 
 // istanbul ignore next: trivial function to ignore from coverage due to how it is structured. Should be refactored in the future so that it can be tested.
 export default function getBackgroundImage(time) {
-    if (time >= 6 && time < 9) {
+    if (true) {
       return BackgroundMorning;
     } else if (time >= 9 && time < 18) {
killedBy: HomePageBackground tests expect correct day background
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "HomePageBackground-day.jpg"
Received: "HomePageBackground-morning.jpg"

[Killed] ConditionalExpression
main/components/Utils/HomePageBackground.js:8:9
 
 // istanbul ignore next: trivial function to ignore from coverage due to how it is structured. Should be refactored in the future so that it can be tested.
 export default function getBackgroundImage(time) {
-    if (time >= 6 && time < 9) {
+    if (true && time < 9) {
       return BackgroundMorning;
     } else if (time >= 9 && time < 18) {
killedBy: HomePageBackground tests expect correct night background
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "HomePageBackground-night.jpg"
Received: "HomePageBackground-morning.jpg"

[Killed] LogicalOperator
main/components/Utils/HomePageBackground.js:10:16
 export default function getBackgroundImage(time) {
     if (time >= 6 && time < 9) {
       return BackgroundMorning;
-    } else if (time >= 9 && time < 18) {
+    } else if (time >= 9 || time < 18) {
       return BackgroundDay;
     } else if (time >= 18 && time < 21) {
killedBy: HomePageBackground tests expect correct evening background
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "HomePageBackground-evening.jpg"
Received: "HomePageBackground-day.jpg"

[Killed] EqualityOperator
main/components/Utils/HomePageBackground.js:10:16
 export default function getBackgroundImage(time) {
     if (time >= 6 && time < 9) {
       return BackgroundMorning;
-    } else if (time >= 9 && time < 18) {
+    } else if (time < 9 && time < 18) {
       return BackgroundDay;
     } else if (time >= 18 && time < 21) {
killedBy: HomePageBackground tests expect correct day background
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "HomePageBackground-day.jpg"
Received: "HomePageBackground-night.jpg"

[Killed] EqualityOperator
main/components/Utils/HomePageBackground.js:12:16
       return BackgroundMorning;
     } else if (time >= 9 && time < 18) {
       return BackgroundDay;
-    } else if (time >= 18 && time < 21) {
+    } else if (time > 18 && time < 21) {
       return BackgroundEvening;
     } else {
killedBy: HomePageBackground tests expect correct evening background
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "HomePageBackground-evening.jpg"
Received: "HomePageBackground-night.jpg"

[Killed] ConditionalExpression
main/components/Utils/HomePageBackground.js:12:16
       return BackgroundMorning;
     } else if (time >= 9 && time < 18) {
       return BackgroundDay;
-    } else if (time >= 18 && time < 21) {
+    } else if (true) {
       return BackgroundEvening;
     } else {
killedBy: HomePageBackground tests expect correct night background
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "HomePageBackground-night.jpg"
Received: "HomePageBackground-evening.jpg"
