[Killed] BlockStatement
src/main/components/OurTable.js:62:90
                 ))}
             </thead>
             <tbody {...getTableBodyProps()}>
-                {rows.slice(pageIndex * pageSize, (pageIndex + 1) * pageSize).map(row => {
-                    prepareRow(row)
-                    return (
-                        <tr {...row.getRowProps()}>
-                            {row.cells.map((cell, _index) => {
-                                return (
-                                    <td
-                                        {...cell.getCellProps()}
-                                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                                    >
-                                        {cell.render('Cell')}
-                                    </td>
-                                )
-                            })}
-                        </tr>
-                    )
-                })}
+                {rows.slice(pageIndex * pageSize, (pageIndex + 1) * pageSize).map(row => {})}
             </tbody>
         </Table>
killedBy: OurTable tests The button appears in the table
statusReason: Error: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
