[Killed] ArithmeticOperator
src/main/components/OurTable.js:58:52
                 ))}
             </thead>
             <tbody {...getTableBodyProps()}>
-                {rows.slice(pageIndex * pageSize, (pageIndex + 1) * pageSize).map(row => {
+                {rows.slice(pageIndex * pageSize, (pageIndex - 1) * pageSize).map(row => {
                     prepareRow(row)
                     return (
killedBy: OurTable tests The button appears in the table
statusReason: Error: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Survived] StringLiteral
src/main/components/OurTable.js:77:56
                 })}
             </tbody>
         </Table>
-        <div style={{ display: "flex", justifyContent: "right" }}>
+        <div style={{ display: "flex", justifyContent: "" }}>
             <Pagination {...getTableProps()}>
                 <Pagination.Prev

[Killed] ArrowFunction
src/main/components/OurTable.js:80:30
         <div style={{ display: "flex", justifyContent: "right" }}>
             <Pagination {...getTableProps()}>
                 <Pagination.Prev
-                    onClick={() => setPageIndex(Math.max(pageIndex - 1, 0))}
+                    onClick={() => undefined}
                     data-testid={`${testid}-prev-page-button`}
                     disabled={pageIndex === 0}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Unable to find an element by: [data-testid=\"testid-back-one-page-button\"]"
Received string:    "expect(received).toBe(expected) // Object.is equality·
Expected: true
Received: false"

[Killed] ArithmeticOperator
src/main/components/OurTable.js:80:58
         <div style={{ display: "flex", justifyContent: "right" }}>
             <Pagination {...getTableProps()}>
                 <Pagination.Prev
-                    onClick={() => setPageIndex(Math.max(pageIndex - 1, 0))}
+                    onClick={() => setPageIndex(Math.max(pageIndex + 1, 0))}
                     data-testid={`${testid}-prev-page-button`}
                     disabled={pageIndex === 0}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Unable to find an element by: [data-testid=\"testid-back-two-page-button\"]"
Received string:    "expect(received).toBe(expected) // Object.is equality·
Expected: true
Received: false"

[Killed] ConditionalExpression
src/main/components/OurTable.js:84:18
                     data-testid={`${testid}-prev-page-button`}
                     disabled={pageIndex === 0}
                 />
-                {pageIndex > 3 && (<Pagination.Item
-                    onClick={() => setPageIndex(0)}
-                    data-testid={`${testid}-first-page-button`}
-                >
-                    {1}
-                </Pagination.Item>)}
+                {true}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
                 {pageIndex === 4 && (<Pagination.Item
killedBy: OurTable tests renders a table with 100 rows and tests the first page button
statusReason: Error: Unable to find an element by: [data-testid="testid-first-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ConditionalExpression
src/main/components/OurTable.js:91:18
                     {1}
                 </Pagination.Item>)}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
-                {pageIndex === 4 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 3)}
-                    data-testid={`${testid}-back-three-page-button`}
-                >
-                    {pageIndex - 2}
-                </Pagination.Item>)}
+                {false}
                 {pageIndex > 1 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 2)}
killedBy: OurTable tests renders a table with 100 rows and moving back three pages
statusReason: Error: Unable to find an element by: [data-testid="testid-back-three-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] LogicalOperator
src/main/components/OurTable.js:97:18
                 >
                     {pageIndex - 2}
                 </Pagination.Item>)}
-                {pageIndex > 1 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 2)}
-                    data-testid={`${testid}-back-two-page-button`}
-                >
-                    {pageIndex - 1}
-                </Pagination.Item>)}
+                {pageIndex > 1 || <Pagination.Item onClick={() => setPageIndex(pageIndex - 2)} data-testid={`${testid}-back-two-page-button`}>
+                    {pageIndex - 1}
+                </Pagination.Item>}
                 {pageIndex > 0 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 1)}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Unable to find an element by: [data-testid=\"testid-back-two-page-button\"]"
Received string:    "expect(received).toBe(expected) // Object.is equality·
Expected: true
Received: false"

[Killed] EqualityOperator
src/main/components/OurTable.js:103:18
                 >
                     {pageIndex - 1}
                 </Pagination.Item>)}
-                {pageIndex > 0 && (<Pagination.Item
+                {pageIndex <= 0 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 1)}
                     data-testid={`${testid}-back-one-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Unable to find an element by: [data-testid=\"testid-back-one-page-button\"]"
Received string:    "expect(received).toBe(expected) // Object.is equality·
Expected: true
Received: false"

[Killed] ConditionalExpression
src/main/components/OurTable.js:103:18
                 >
                     {pageIndex - 1}
                 </Pagination.Item>)}
-                {pageIndex > 0 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 1)}
-                    data-testid={`${testid}-back-one-page-button`}
-                >
-                    {pageIndex}
-                </Pagination.Item>)}
+                {true}
                 <Pagination.Item
                     data-testid={`${testid}-current-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the last page button
statusReason: Error: Unable to find an element by: [data-testid="testid-back-one-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Survived] BooleanLiteral
src/main/components/OurTable.js:111:29
                 </Pagination.Item>)}
                 <Pagination.Item
                     data-testid={`${testid}-current-page-button`}
-                    active={true}
+                    active={false}
                 >
                     {pageIndex + 1}

[Killed] ArithmeticOperator
src/main/components/OurTable.js:113:22
                     data-testid={`${testid}-current-page-button`}
                     active={true}
                 >
-                    {pageIndex + 1}
+                    {pageIndex - 1}
                 </Pagination.Item>
                 {pageIndex + 1 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
killedBy: OurTable tests renders a table with 30 rows and clicks on the next page button
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">0<span class="visually-hidden">(current)</span></span>

[Killed] ArithmeticOperator
src/main/components/OurTable.js:115:45
                 >
                     {pageIndex + 1}
                 </Pagination.Item>
-                {pageIndex + 1 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
+                {pageIndex + 1 <= Math.ceil(rows.length * pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex + 1)}
                     data-testid={`${testid}-forward-one-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the last page button
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="page-link" data-testid="testid-forward-one-page-button" href="#" role="button" tabindex="0">11</a> instead

[Killed] LogicalOperator
src/main/components/OurTable.js:115:18
                 >
                     {pageIndex + 1}
                 </Pagination.Item>
-                {pageIndex + 1 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 1)}
-                    data-testid={`${testid}-forward-one-page-button`}
-                >
-                    {pageIndex + 2}
-                </Pagination.Item>)}
+                {pageIndex + 1 <= Math.ceil(rows.length / pageSize - 1) || <Pagination.Item onClick={() => setPageIndex(pageIndex + 1)} data-testid={`${testid}-forward-one-page-button`}>
+                    {pageIndex + 2}
+                </Pagination.Item>}
                 {pageIndex + 2 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex + 2)}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-forward-one-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
src/main/components/OurTable.js:116:30
                     {pageIndex + 1}
                 </Pagination.Item>
                 {pageIndex + 1 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 1)}
+                    onClick={() => undefined}
                     data-testid={`${testid}-forward-one-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and tests moving forward one page
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">1<span class="visually-hidden">(current)</span></span>

[Killed] ArithmeticOperator
src/main/components/OurTable.js:116:49
                     {pageIndex + 1}
                 </Pagination.Item>
                 {pageIndex + 1 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 1)}
+                    onClick={() => setPageIndex(pageIndex - 1)}
                     data-testid={`${testid}-forward-one-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and tests moving forward one page
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">0<span class="visually-hidden">(current)</span></span>

[Killed] StringLiteral
src/main/components/OurTable.js:117:34
                 </Pagination.Item>
                 {pageIndex + 1 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex + 1)}
-                    data-testid={`${testid}-forward-one-page-button`}
+                    data-testid={``}
                 >
                     {pageIndex + 2}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-forward-one-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArithmeticOperator
src/main/components/OurTable.js:119:22
                     onClick={() => setPageIndex(pageIndex + 1)}
                     data-testid={`${testid}-forward-one-page-button`}
                 >
-                    {pageIndex + 2}
+                    {pageIndex - 2}
                 </Pagination.Item>)}
                 {pageIndex + 2 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
killedBy: OurTable tests renders a table with 100 rows and moving back three pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  4
Received:
  <a class="page-link" data-testid="testid-forward-one-page-button" href="#" role="button" tabindex="0">0</a>

[Killed] ArithmeticOperator
src/main/components/OurTable.js:121:18
                 >
                     {pageIndex + 2}
                 </Pagination.Item>)}
-                {pageIndex + 2 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
+                {pageIndex - 2 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex + 2)}
                     data-testid={`${testid}-forward-two-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the last page button
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="page-link" data-testid="testid-forward-two-page-button" href="#" role="button" tabindex="0">12</a> instead

[Killed] ConditionalExpression
src/main/components/OurTable.js:121:18
                 >
                     {pageIndex + 2}
                 </Pagination.Item>)}
-                {pageIndex + 2 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 2)}
-                    data-testid={`${testid}-forward-two-page-button`}
-                >
-                    {pageIndex + 3}
-                </Pagination.Item>)}
+                {true}
                 {pageIndex + 4 === Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex + 3)}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-forward-two-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
src/main/components/OurTable.js:122:30
                     {pageIndex + 2}
                 </Pagination.Item>)}
                 {pageIndex + 2 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 2)}
+                    onClick={() => undefined}
                     data-testid={`${testid}-forward-two-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and moving forward two pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  3
Received:
  <span class="page-link" data-testid="testid-current-page-button">1<span class="visually-hidden">(current)</span></span>

[Killed] ArithmeticOperator
src/main/components/OurTable.js:122:49
                     {pageIndex + 2}
                 </Pagination.Item>)}
                 {pageIndex + 2 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 2)}
+                    onClick={() => setPageIndex(pageIndex - 2)}
                     data-testid={`${testid}-forward-two-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and moving forward two pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  3
Received:
  <span class="page-link" data-testid="testid-current-page-button">-1<span class="visually-hidden">(current)</span></span>

[Killed] StringLiteral
src/main/components/OurTable.js:123:34
                 </Pagination.Item>)}
                 {pageIndex + 2 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex + 2)}
-                    data-testid={`${testid}-forward-two-page-button`}
+                    data-testid={``}
                 >
                     {pageIndex + 3}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-forward-two-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Survived] ArithmeticOperator
src/main/components/OurTable.js:125:22
                     onClick={() => setPageIndex(pageIndex + 2)}
                     data-testid={`${testid}-forward-two-page-button`}
                 >
-                    {pageIndex + 3}
+                    {pageIndex - 3}
                 </Pagination.Item>)}
                 {pageIndex + 4 === Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item

[Killed] ConditionalExpression
src/main/components/OurTable.js:127:18
                 >
                     {pageIndex + 3}
                 </Pagination.Item>)}
-                {pageIndex + 4 === Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 3)}
-                    data-testid={`${testid}-forward-three-page-button`}
-                >
-                    {pageIndex + 4}
-                </Pagination.Item>)}
+                {true}
                 {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) && (<Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />)}
                 {pageIndex + 4 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
killedBy: OurTable tests renders a table with 100 rows and tests moving forward three pages
statusReason: Error: Unable to find an element by: [data-testid="testid-forward-three-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ConditionalExpression
src/main/components/OurTable.js:127:18
                 >
                     {pageIndex + 3}
                 </Pagination.Item>)}
-                {pageIndex + 4 === Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
+                {true && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex + 3)}
                     data-testid={`${testid}-forward-three-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Unable to find an element by: [data-testid=\"testid-forward-three-page-button\"]"
Received string:    "expect(received).toBe(expected) // Object.is equality·
Expected: true
Received: false"

[Killed] ArrowFunction
src/main/components/OurTable.js:128:30
                     {pageIndex + 3}
                 </Pagination.Item>)}
                 {pageIndex + 4 === Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 3)}
+                    onClick={() => undefined}
                     data-testid={`${testid}-forward-three-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and tests moving forward three pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  9
Received:
  <span class="page-link" data-testid="testid-current-page-button">6<span class="visually-hidden">(current)</span></span>

[Killed] ArithmeticOperator
src/main/components/OurTable.js:128:49
                     {pageIndex + 3}
                 </Pagination.Item>)}
                 {pageIndex + 4 === Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex + 3)}
+                    onClick={() => setPageIndex(pageIndex - 3)}
                     data-testid={`${testid}-forward-three-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and tests moving forward three pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  9
Received:
  <span class="page-link" data-testid="testid-current-page-button">3<span class="visually-hidden">(current)</span></span>

[Killed] StringLiteral
src/main/components/OurTable.js:129:34
                 </Pagination.Item>)}
                 {pageIndex + 4 === Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex + 3)}
-                    data-testid={`${testid}-forward-three-page-button`}
+                    data-testid={``}
                 >
                     {pageIndex + 4}
killedBy: OurTable tests renders a table with 100 rows and tests moving forward three pages
statusReason: Error: Unable to find an element by: [data-testid="testid-forward-three-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArithmeticOperator
src/main/components/OurTable.js:131:22
                     onClick={() => setPageIndex(pageIndex + 3)}
                     data-testid={`${testid}-forward-three-page-button`}
                 >
-                    {pageIndex + 4}
+                    {pageIndex - 4}
                 </Pagination.Item>)}
                 {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) && (<Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />)}
killedBy: OurTable tests renders a table with 100 rows and tests moving forward three pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  9
Received:
  <a class="page-link" data-testid="testid-forward-three-page-button" href="#" role="button" tabindex="0">1</a>

[Killed] LogicalOperator
src/main/components/OurTable.js:133:18
                 >
                     {pageIndex + 4}
                 </Pagination.Item>)}
-                {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) && (<Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />)}
+                {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) || <Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />}
                 {pageIndex + 4 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(Math.ceil(rows.length / pageSize - 1))}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-right-ellipsis"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ConditionalExpression
src/main/components/OurTable.js:133:18
                 >
                     {pageIndex + 4}
                 </Pagination.Item>)}
-                {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) && (<Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />)}
+                {true}
                 {pageIndex + 4 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(Math.ceil(rows.length / pageSize - 1))}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-right-ellipsis"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ConditionalExpression
src/main/components/OurTable.js:134:18
                     {pageIndex + 4}
                 </Pagination.Item>)}
                 {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) && (<Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />)}
-                {pageIndex + 4 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(Math.ceil(rows.length / pageSize - 1))}
-                    data-testid={`${testid}-last-page-button`}
-                >
-                    {Math.ceil(rows.length / pageSize)}
-                </Pagination.Item>)}
+                {false}
                 <Pagination.Next {...getTableBodyProps()}
                     onClick={() => setPageIndex(Math.min(pageIndex + 1, Math.ceil(rows.length / pageSize - 1)))}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-last-page-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArithmeticOperator
src/main/components/OurTable.js:134:45
                     {pageIndex + 4}
                 </Pagination.Item>)}
                 {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) && (<Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />)}
-                {pageIndex + 4 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
+                {pageIndex + 4 <= Math.ceil(rows.length * pageSize - 1) && (<Pagination.Item
                     onClick={() => setPageIndex(Math.ceil(rows.length / pageSize - 1))}
                     data-testid={`${testid}-last-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the last page button
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="page-link" data-testid="testid-last-page-button" href="#" role="button" tabindex="0">10</a> instead

[Killed] ArrowFunction
src/main/components/OurTable.js:135:30
                 </Pagination.Item>)}
                 {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) && (<Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />)}
                 {pageIndex + 4 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(Math.ceil(rows.length / pageSize - 1))}
+                    onClick={() => undefined}
                     data-testid={`${testid}-last-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and tests the last page button
statusReason: Error: expect(element).toContainHTML()
Expected:
  10
Received:
  <span class="page-link" data-testid="testid-current-page-button">1<span class="visually-hidden">(current)</span></span>

[Killed] ArithmeticOperator
src/main/components/OurTable.js:135:59
                 </Pagination.Item>)}
                 {pageIndex + 4 < Math.ceil(rows.length / pageSize - 1) && (<Pagination.Ellipsis data-testid={`${testid}-right-ellipsis`} />)}
                 {pageIndex + 4 <= Math.ceil(rows.length / pageSize - 1) && (<Pagination.Item
-                    onClick={() => setPageIndex(Math.ceil(rows.length / pageSize - 1))}
+                    onClick={() => setPageIndex(Math.ceil(rows.length * pageSize - 1))}
                     data-testid={`${testid}-last-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and tests the last page button
statusReason: Error: Unable to find an element with the text: Hello 90. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-co
