[Survived] ArithmeticOperator
src/main/components/OurTable.js:138:32
                     onClick={() => setPageIndex(Math.ceil(rows.length / pageSize - 1))}
                     data-testid={`${testid}-last-page-button`}
                 >
-                    {Math.ceil(rows.length / pageSize)}
+                    {Math.ceil(rows.length * pageSize)}
                 </Pagination.Item>)}
                 <Pagination.Next {...getTableBodyProps()}

[Killed] ArithmeticOperator
src/main/components/OurTable.js:141:58
                     {Math.ceil(rows.length / pageSize)}
                 </Pagination.Item>)}
                 <Pagination.Next {...getTableBodyProps()}
-                    onClick={() => setPageIndex(Math.min(pageIndex + 1, Math.ceil(rows.length / pageSize - 1)))}
+                    onClick={() => setPageIndex(Math.min(pageIndex - 1, Math.ceil(rows.length / pageSize - 1)))}
                     data-testid={`${testid}-next-page-button`}
                     disabled={pageIndex === Math.ceil(rows.length / pageSize - 1) || rows.length === 0}
killedBy: OurTable tests renders a table with 30 rows and clicks on the next page button
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">0<span class="visually-hidden">(current)</span></span>

[Killed] ArrowFunction
src/main/components/OurTable.js:141:30
                     {Math.ceil(rows.length / pageSize)}
                 </Pagination.Item>)}
                 <Pagination.Next {...getTableBodyProps()}
-                    onClick={() => setPageIndex(Math.min(pageIndex + 1, Math.ceil(rows.length / pageSize - 1)))}
+                    onClick={() => undefined}
                     data-testid={`${testid}-next-page-button`}
                     disabled={pageIndex === Math.ceil(rows.length / pageSize - 1) || rows.length === 0}
killedBy: OurTable tests renders a table with 30 rows and clicks on the next page button
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">1<span class="visually-hidden">(current)</span></span>

[Killed] ConditionalExpression
src/main/components/OurTable.js:143:86
                 <Pagination.Next {...getTableBodyProps()}
                     onClick={() => setPageIndex(Math.min(pageIndex + 1, Math.ceil(rows.length / pageSize - 1)))}
                     data-testid={`${testid}-next-page-button`}
-                    disabled={pageIndex === Math.ceil(rows.length / pageSize - 1) || rows.length === 0}
+                    disabled={pageIndex === Math.ceil(rows.length / pageSize - 1) || false}
                 />
             </Pagination>
killedBy: OurTable tests previous and next page buttons are disabled when there is no data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/main/components/OurTable.js:143:31
                 <Pagination.Next {...getTableBodyProps()}
                     onClick={() => setPageIndex(Math.min(pageIndex + 1, Math.ceil(rows.length / pageSize - 1)))}
                     data-testid={`${testid}-next-page-button`}
-                    disabled={pageIndex === Math.ceil(rows.length / pageSize - 1) || rows.length === 0}
+                    disabled={false}
                 />
             </Pagination>
killedBy: OurTable tests previous and next page buttons are disabled when there is no data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
